cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'cloudfoundry/tap'
tap 'pivotal/tap'

brew 'aria2'
brew 'awscli'
brew 'bbl'
brew 'black'
brew 'bosh-cli'
brew 'cf-cli'
brew 'coreutils'
brew 'credhub-cli'
brew 'dep'
brew 'cmake'
brew 'direnv'
brew 'fd'
brew 'findutils'
brew 'git'
brew 'go'
brew 'grep'
brew 'homeshick'
brew 'hub'
brew 'jq'
brew 'jump'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'lastpass-cli'
brew 'minio-mc'
brew 'neovim'
brew 'node'
brew 'pinentry'
brew 'pivnet-cli'
brew 'python'
brew 'python3'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'shellcheck'
brew 'the_silver_searcher'
brew 'tmux'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ["HEAD"]
brew 'watch'
brew 'wget'
brew 'yq'
brew 'zsh'
brew 'zsh-syntax-highlighting'

cask 'alacritty'
cask 'docker'
cask 'fly'
cask 'flycut'
cask 'goland'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'gpg-suite'
cask 'hammerspoon'
cask 'java'
cask 'lastpass'
cask 'macdown'
cask 'slack'
cask 'spotify'
cask 'telegram-desktop'
cask 'virtualbox'
cask 'whatsapp'
cask 'zoomus'

cask 'font-fira-code'
cask 'font-fira-mono-for-powerline'
cask 'font-hack-nerd-font'
cask 'font-inconsolata'
cask 'font-meslo-for-powerline'

mas 'Bear', id: 1091189122
mas 'Spark', id: 1176895641
mas 'Trello', id: 1278508951
mas 'Tweetbot', id: 557168941
mas 'Wunderlist', id: 410628904
